Feature: UI test
  Scenario: 5 items test
    Given открыть главную страницу
    And зарегистрировать тестового пользователя

    When открыть 1-й товар
    And выбрать 5 единиц товара и добавть его в корзину
    And подтвердить что в корзине 5 единиц товара
    Then перейти к оформлению
    When заполнить информацию для оплаты и разместить заказ
    Then подтвердить что заказ успешно создан и содержит 5 единиц товара

  Scenario: 1 item test
    Given открыть главную страницу
    And зарегистрировать тестового пользователя

    When открыть 1-й товар
    And выбрать 1 единиц товара и добавть его в корзину
    And подтвердить что в корзине 1 единиц товара
    Then перейти к оформлению
    When заполнить информацию для оплаты и разместить заказ
    Then подтвердить что заказ успешно создан и содержит 1 единиц товара
